# GetCellFormatOptions Method (Int32, Document) (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
TableSectionData..::..GetCellFormatOptions Method (Int32, Document)
TableSectionData Class See Also
---
Returns a column's cell FormatOptions and if no FormatOptions exists for this column, it would come from the section.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public FormatOptions GetCellFormatOptions(
	int nCol,
	Document ccda
)
```

Visual Basic
---
```text
Public Function GetCellFormatOptions ( _
	nCol As Integer, _
	ccda As Document _
) As FormatOptions
```

Visual C++
---
```text
public:
FormatOptions^ GetCellFormatOptions(
	int nCol,
	Document^ ccda
)
```

# ### Parameters
nCol
    Type: System..::..Int32
ccda
    Type: Autodesk.Revit.DB..::..Document
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TableSectionData Class
GetCellFormatOptions Overload
Autodesk.Revit.DB Namespace